In [1]:
"""Look again."""

import pandas as pd

In [2]:
people = {
    "first": ["Corey", 'Jane', 'John'],
    "last": ["Schafer", 'Doe', 'Doe'],
    "email": ["CoreyMSchafer@gmail.com", 'JaneDoe@email.com',
              'JohnDoe@email.com']
}

In [3]:
df = pd.DataFrame(people)

In [4]:
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com

In [5]:
df.columns

Index(['first', 'last', 'email'], dtype='object')

In [6]:
"""Rename the columns."""
df.columns = ["first name", "last name", "email"]

In [7]:
df.columns

Index(['first name', 'last name', 'email'], dtype='object')

In [8]:
df

  first name last name                    email
0      Corey   Schafer  CoreyMSchafer@gmail.com
1       Jane       Doe        JaneDoe@email.com
2       John       Doe        JohnDoe@email.com

In [9]:
"""Make all of the columns' title, upper-case."""
df.columns = [x.upper() for x in df.columns]

In [10]:
df

  FIRST NAME LAST NAME                    EMAIL
0      Corey   Schafer  CoreyMSchafer@gmail.com
1       Jane       Doe        JaneDoe@email.com
2       John       Doe        JohnDoe@email.com

In [11]:
"""Replace spaces with underscores."""
df.columns = df.columns.str.replace(" ", "_")

In [12]:
df

  FIRST_NAME LAST_NAME                    EMAIL
0      Corey   Schafer  CoreyMSchafer@gmail.com
1       Jane       Doe        JaneDoe@email.com
2       John       Doe        JohnDoe@email.com

In [13]:
"""Make all of the columns' title, lower-case."""
df.columns = [x.lower() for x in df.columns]

In [14]:
df

  first_name last_name                    email
0      Corey   Schafer  CoreyMSchafer@gmail.com
1       Jane       Doe        JaneDoe@email.com
2       John       Doe        JohnDoe@email.com

In [15]:
"""inplace=True renames the columns of main df dataframe."""
df.rename(columns={"first_name": "first", "last_name": "last"}, inplace=True)

In [16]:
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com

In [17]:
df.loc[2]

first                 John
last                   Doe
email    JohnDoe@email.com
Name: 2, dtype: object

In [18]:
df.loc[2] = ["Erfan", "Rasti", "erfanrasty@gmail.com"]

In [19]:
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2  Erfan    Rasti     erfanrasty@gmail.com

In [20]:
df.loc[2, ["first", "last", "email"]] = ["John", "Doe", "JohnDoe@email.com"]

In [21]:
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com

In [22]:
df.loc[2, "last"] = "Smith"

In [23]:
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John    Smith        JohnDoe@email.com

In [24]:
"""df.at is like df.loc when we wanna get or set an single value;
But the performance of df.at is more."""
df.at[2, "last"] = "Doe"

In [25]:
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com

In [26]:
filt = (df["email"] == "JohnDoe@email.com")
df[filt]

  first last              email
2  John  Doe  JohnDoe@email.com

In [27]:
df[filt]["last"]
df[filt]["last"] = "Smith"
"""We can't use df[filt]["last"]='Smith' to change the value.
It will raise a Warning and it won't change the value."""

C:\Users\ERFAN\anaconda3\lib\site-packages\ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

'We can\'t use df[filt]["last"]=\'Smith\' to change the value.\nIt will raise a Warning and it won\'t change the value.'

In [28]:
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com

In [29]:
df[filt]["last"]
df.loc[filt, "last"] = "Smith"

In [30]:
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John    Smith        JohnDoe@email.com

In [31]:
"""Make all email addresses lower-case."""
df["email"].str.lower()

0    coreymschafer@gmail.com
1          janedoe@email.com
2          johndoe@email.com
Name: email, dtype: object

In [32]:
"""Change the main dataframe email addresses to lower-case."""
df["email"] = df["email"].str.lower()

In [33]:
df

   first     last                    email
0  Corey  Schafer  coreymschafer@gmail.com
1   Jane      Doe        janedoe@email.com
2   John    Smith        johndoe@email.com

In [34]:
"""Let's get familiar with apple method."""
df["email"].apply(len)

0    23
1    17
2    17
Name: email, dtype: int64

In [35]:


def update_email(email):
    """Make email addresses, upper-case."""
    return email.upper()

In [37]:
df["email"].apply(update_email)

0    COREYMSCHAFER@GMAIL.COM
1          JANEDOE@EMAIL.COM
2          JOHNDOE@EMAIL.COM
Name: email, dtype: object